
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      Stata 18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 2-core network, expiring 29 Jan 2025
Serial number: 501809305331
  Licensed to: IT Services
               University of Bristol

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.


Running C:\PROGRA~1\Stata18\profile.do ...

. do "C:/Users/zd20208/OneDrive - University of Bristol/Desktop/2020 Bristol Ph
> D/Main Project/Data/Scripts/MainAssocAnalysis/ALSPAC_00b_extract_raw_exp_cov.
> do" 

. /****************************************************************************
> ***
> ADAPTED FROM: "4.syntax_template_covars.do" written by the MR-PREG team
> Added in more raw variables for project-specific analysis
> *****************************************************************************
> **/
. 
. *****************************************************************************
> ***
. ********** ALSPAC SYNTAX - MR-PREG **********
. *********************************************
. 
. cd "Z:\working\data\ALSPAC"
Z:\working\data\ALSPAC

. 
. *** Syntax template for direct users preparing datasets using child and paren
> t based datasets.
. * Last update:
. * Updated 25th July 2023 - updated withdrawal of consent frequencies (mother 
> and child based)
. 
. 
. 
. *****************************************************************************
> *****************************************************************************
> ******************************************************************
. * This template is based on that used by the data buddy team and they include
>  a number of variables by default.
. * To ensure the file works we suggest you keep those in and just add any rele
> vant variables that you need for your project.
. * To add data other than that included by default you will need to add the re
> lvant files and pathnames in each of the match commands below.
. * There is a separate command for mothers questionnaires, mothers clinics, pa
> rtner, mothers providing data on the child and data provided by the child the
> mselves.
. * Each has different withdrawal of consent issues so they must be considered 
> separately.
. * You will need to replace 'YOUR PATHNAME' in each section with your working 
> directory pathname.
. 
. *****************************************************************************
> *****************************************************************************
> *******************************************************************.
. 
. * G0 Mother (pregnancy) based files - include here all files related to the p
> regnancy and/or mother
. 
. * If no mother variables are required, KEEP this section and remove the instr
> uction below to run it..
. 
. clear

. set maxvar 32767        


. use "\\ads.bris.ac.uk\filestore\SSCM ALSPAC\Data\Current\Other\Cohort Profile
> \mz_6a.dta", clear

. sort aln

. gen in_mz=1

. keep aln mz010a preg_in_alsp preg_in_core preg_enrol_status mz005l mz005m mz0
> 13 mz014 mz028b mz010a mz005k bestgest

. merge 1:1 aln using "\\ads.bris.ac.uk\filestore\SSCM ALSPAC\Data\Current\Ques
> t\Mother\a_3e.dta", keepus(a222-a234 a420-a424 a525) nogen
--Break--
r(1);

end of do-file
--Break--
r(1);
